#include "lcd.h"
#include "gui.h"
#include "app1.h"

/*
*******************************************************************************
*		模块名称	:	主程序模块
*		文件名称	:	main.c
*		版		本	:	V0.1
*		说		明	：控制LED灯,PWM调光
*		修改记录:
*				版本号		日期				作者				说明
*				V0.1			2021-11-26	JINCHANG		初版
*
*			Copyright	(C) , 2021-2021 , JINCHANG	blog.hinuohui.com
*******************************************************************************
*/


/********************************************************************************

*		函数名: APP_inint()

*		功	能：初始化显示界面
·		
*		输	入:	无

*		输	出:	无

*******************************************************************************/

void APP_inint()
{
	
 
	 LCD_DrawRectangle(80,100, 400, 260);								//矩形
	 LCD_DrawLine(80,180,400,180);											//矩形分区
	 gui_circle(90,110 ,BLACK,4,1);											//画圆,方向标记点

		 

	

}	



